# CurrentUsersDataFolderPath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..CurrentUsersDataFolderPath Property
Application Class See Also
---
Path to data folder for the current user.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public string CurrentUsersDataFolderPath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurrentUsersDataFolderPath As String
	Get
```

Visual C++
---
```text
public:
property String^ CurrentUsersDataFolderPath {
	String^ get ();
}
```

# Remarks
Similar to C:\Users\\[UserName]\AppData\Roaming\Autodesk\\[ProductType]\\[ReleaseName]
# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace